MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM365FYXBG/mcu.h
/**
 *******************************************************************************
 * @file    TMPM365.h
 * @brief   CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM365' Device Series
 * @version V2.0.2.1.1 (Tentative)
 * @date    2012/02/28
 * 
 * THE SOURCE CODE AND ITS RELATED DOCUMENTATION IS PROVIDED "AS IS". TOSHIBA
 * CORPORATION MAKES NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED OR,
 * STATUTORY AND DISCLAIMS ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY,
 * SATISFACTORY QUALITY, NON INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
 * 
 * THE SOURCE CODE AND DOCUMENTATION MAY INCLUDE ERRORS. TOSHIBA CORPORATION
 * RESERVES THE RIGHT TO INCORPORATE MODIFICATIONS TO THE SOURCE CODE IN LATER
 * REVISIONS OF IT, AND TO MAKE IMPROVEMENTS OR CHANGES IN THE DOCUMENTATION OR
 * THE PRODUCTS OR TECHNOLOGIES DESCRIBED THEREIN AT ANY TIME.
 * 
 * TOSHIBA CORPORATION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
 * CONSEQUENTIAL DAMAGE OR LIABILITY ARISING FROM YOUR USE OF THE SOURCE CODE OR
 * ANY DOCUMENTATION, INCLUDING BUT NOT LIMITED TO, LOST REVENUES, DATA OR
 * PROFITS, DAMAGES OF ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL NATURE, PUNITIVE
 * DAMAGES, LOSS OF PROPERTY OR LOSS OF PROFITS ARISING OUT OF OR IN CONNECTION
 * WITH THIS AGREEMENT, OR BEING UNUSABLE, EVEN IF ADVISED OF THE POSSIBILITY OR
 * PROBABILITY OF SUCH DAMAGES AND WHETHER A CLAIM FOR SUCH DAMAGE IS BASED UPON
 * WARRANTY, CONTRACT, TORT, NEGLIGENCE OR OTHERWISE.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2012 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TX03_MICROCONTROLLER
  * @{
  */

/** @addtogroup TMPM365
  * @{
  */

#ifndef __TMPM365_H__
#define __TMPM365_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
    typedef enum IRQn {
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************************/
        NonMaskableInt_IRQn = -14,      /*!< 2 Non Maskable Interrupt                                    */
        HardFault_IRQn = -13,   /*!< 3 Cortex-M3 Hard Fault Interrupt                            */
        MemoryManagement_IRQn = -12,    /*!< 4 Cortex-M3 Memory Management Interrupt                     */
        BusFault_IRQn = -11,    /*!< 5 Cortex-M3 Bus Fault Interrupt                             */
        UsageFault_IRQn = -10,  /*!< 6 Cortex-M3 Usage Fault Interrupt                           */
        SVCall_IRQn = -5,       /*!< 11 Cortex-M3 SV Call Interrupt                              */
        DebugMonitor_IRQn = -4, /*!< 12 Cortex-M3 Debug Monitor Interrupt                        */
        PendSV_IRQn = -2,       /*!< 14 Cortex-M3 Pend SV Interrupt                              */
        SysTick_IRQn = -1,      /*!< 15 Cortex-M3 System Tick Interrupt                          */

/******  TMPM365 Specific Interrupt Numbers *******************************************************************/
        INT0_IRQn = 0,          /*!< Interrupt pin 0                                             */
        INT1_IRQn = 1,          /*!< Interrupt pin 1                                             */
        INT2_IRQn = 2,          /*!< Interrupt pin 2                                             */
        INT3_IRQn = 3,          /*!< Interrupt pin 3                                             */
        INT4_IRQn = 4,          /*!< Interrupt pin 4                                             */
        INT5_IRQn = 5,          /*!< Interrupt pin 5                                             */
        INT6_IRQn = 6,          /*!< Interrupt pin 6                                             */
        INT7_IRQn = 7,          /*!< Interrupt pin 7                                             */
        INTRX0_IRQn = 8,        /*!< Serial reception (channel.0)                                */
        INTTX0_IRQn = 9,        /*!< Serial transmission (channel.0)                             */
        INTRX1_IRQn = 10,       /*!< Serial reception (channel.1)                                */
        INTTX1_IRQn = 11,       /*!< Serial transmission (channel.1)                             */
        INTUSBWKUP_IRQn = 12,   /*!< USB WakeUp                                                  */
        INTSBI0_IRQn = 14,      /*!< Serial bus interface 0                                      */
        INTSBI1_IRQn = 15,      /*!< Serial bus interface 1                                      */
        INTADHP_IRQn = 16,      /*!< Highest priority AD conversion complete interrupt           */
        INTAD_IRQn = 17,        /*!< AD conversion interrupt                                     */
        INTADM0_IRQn = 18,      /*!< AD conversion monitoring function interrupt 0               */
        INTADM1_IRQn = 19,      /*!< AD conversion monitoring function interrupt 1               */
        INTTB0_IRQn = 20,       /*!< 16-bit TMRB match detection 0                               */
        INTTB1_IRQn = 21,       /*!< 16-bit TMRB match detection 1                               */
        INTTB2_IRQn = 22,       /*!< 16-bit TMRB match detection 2                               */
        INTTB3_IRQn = 23,       /*!< 16-bit TMRB match detection 3                               */
        INTTB4_IRQn = 24,       /*!< 16-bit TMRB match detection 4                               */
        INTTB5_IRQn = 25,       /*!< 16-bit TMRB match detection 5                               */
        INTTB6_IRQn = 26,       /*!< 16-bit TMRB match detection 6                               */
        INTTB7_IRQn = 27,       /*!< 16-bit TMRB match detection 7                               */
        INTTB8_IRQn = 28,       /*!< 16-bit TMRB match detection 8                               */
        INTTB9_IRQn = 29,       /*!< 16-bit TMRB match detection 9                               */
        INTUSB_IRQn = 30,       /*!< USB Interrupt                                               */
        INTUSBPON_IRQn = 34,    /*!< USB V-Bus _Power on Detect                                  */
        INTCAP00_IRQn = 36,     /*!< 16-bit TMRB input capture 00                                */
        INTCAP01_IRQn = 37,     /*!< 16-bit TMRB input capture 01                                */
        INTCAP10_IRQn = 38,     /*!< 16-bit TMRB input capture 10                                */
        INTCAP11_IRQn = 39,     /*!< 16-bit TMRB input capture 11                                */
        INTCAP20_IRQn = 40,     /*!< 16-bit TMRB input capture 20                                */
        INTCAP21_IRQn = 41,     /*!< 16-bit TMRB input capture 21                                */
        INTCAP30_IRQn = 42,     /*!< 16-bit TMRB input capture 30                                */
        INTCAP31_IRQn = 43,     /*!< 16-bit TMRB input capture 31                                */
        INTCAP40_IRQn = 44,     /*!< 16-bit TMRB input capture 40                                */
        INTCAP41_IRQn = 45,     /*!< 16-bit TMRB input capture 41                                */
        INTCAP50_IRQn = 46,     /*!< 16-bit TMRB input capture 50                                */
        INTCAP51_IRQn = 47,     /*!< 16-bit TMRB input capture 51                                */
        INTCAP60_IRQn = 48,     /*!< 16-bit TMRB input capture 60                                */
        INTCAP61_IRQn = 49,     /*!< 16-bit TMRB input capture 61                                */
        INTCAP70_IRQn = 50,     /*!< 16-bit TMRB input capture 70                                */
        INTCAP71_IRQn = 51,     /*!< 16-bit TMRB input capture 71                                */
        INTCAP80_IRQn = 52,     /*!< 16-bit TMRB input capture 80                                */
        INTCAP81_IRQn = 53,     /*!< 16-bit TMRB input capture 81                                */
        INTCAP90_IRQn = 54,     /*!< 16-bit TMRB input capture 90                                */
        INTCAP91_IRQn = 55,     /*!< 16-bit TMRB input capture 91                                */
        INT8_IRQn = 56,         /*!< Interrupt pin 8                                             */
        INT9_IRQn = 57,         /*!< Interrupt pin 9                                             */
        INTDMAC0TC_IRQn = 60,   /*!< DMA terminal count status interrupt 0                       */
        INTABTLOSS0_IRQn = 61,  /*!< I2C arbitration lost interrupt 0                            */
        INTDMAC0ERR_IRQn = 62,  /*!< DMA error status interrupt 0                                */
        INTABTLOSS1_IRQn = 63   /*!< I2C arbitration lost interrupt 1                            */
    } IRQn_Type;

