MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM365FYXBG/mcu.h
/** Processor and Core Peripheral Section */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __CM3_REV              0x0200   /*!< Cortex-M3 Core Revision                           */
#define __MPU_PRESENT             0     /*!< MPU present or not                                */
#define __NVIC_PRIO_BITS          3     /*!< Number of Bits used for Priority Levels           */
#define __Vendor_SysTickConfig    0     /*!< Set to 1 if different SysTick Config is used      */

    /** @} *//* End of group Configuration_of_CMSIS */

#include "core_cm3.h"           /* Cortex-M3 processor and core peripherals            */
// Note: Changed for MikroE implementation.
// #include "system_TMPM365.h"     /* TMPM365 System                                      */

/** @addtogroup Device_Peripheral_registers
  * @{
  */

/** Device Specific Peripheral registers structures */

/**
  * @brief DMA Controller
  */
    typedef struct {
        __I uint32_t INTSTATUS; /*!< DMAC Interrupt Status Register               */
        __I uint32_t INTTCSTATUS;       /*!< DMAC Interrupt Terminal Count Status Register */
        __O uint32_t INTTCCLEAR;        /*!< DMAC Interrupt Terminal Count Clear Register */
        __I uint32_t INTERRORSTATUS;    /*!< DMAC Interrupt Error Status Register         */
        __O uint32_t INTERRCLR; /*!< DMAC Interrupt Error Clear Register          */
        __I uint32_t RAWINTTCSTATUS;    /*!< DMAC Raw Interrupt Terminal Count Status Register */
        __I uint32_t RAWINTERRORSTATUS; /*!< DMAC Raw Error Interrupt Status Register     */
        __I uint32_t ENBLDCHNS; /*!< DMAC Enabled Channel Register                */
        __IO uint32_t SOFTBREQ; /*!< DMAC Software Burst Request Register         */
        __IO uint32_t SOFTSREQ; /*!< DMAC Software Single Request Register        */
        uint32_t RESERVED0[2];
        __IO uint32_t CONFIGURATION;    /*!< DMAC Configuration Register                  */
        uint32_t RESERVED1[51];
        __IO uint32_t C0SRCADDR;        /*!< DMAC Channel0 Source Address Register        */
        __IO uint32_t C0DESTADDR;       /*!< DMAC Channel0 Destination Address Register   */
        __IO uint32_t C0LLI;    /*!< DMAC Channel0 Linked List Item Register      */
        __IO uint32_t C0CONTROL;        /*!< DMAC Channel0 Control Register               */
        __IO uint32_t C0CONFIGURATION;  /*!< DMAC Channel0 Configuration Register         */
        uint32_t RESERVED2[3];
        __IO uint32_t C1SRCADDR;        /*!< DMAC Channel1 Source Address Register        */
        __IO uint32_t C1DESTADDR;       /*!< DMAC Channel1 Destination Address Register   */
        __IO uint32_t C1LLI;    /*!< DMAC Channel1 Linked List Item Register      */
        __IO uint32_t C1CONTROL;        /*!< DMAC Channel1 Control Register               */
        __IO uint32_t C1CONFIGURATION;  /*!< DMAC Channel1 Configuration Register         */
    } TSB_DMAC_TypeDef;

/**
  * @brief UDC2 AHB Bridge
  */
    typedef struct {
        __IO uint32_t INTSTS;   /*!< Interrupt Status Register                    */
        __IO uint32_t INTENB;   /*!< Interrupt Enable Register                    */
        __IO uint32_t MWTOUT;   /*!< Master Write Timeout Register                */
        __IO uint32_t C2STSET;  /*!< UDC2 setting                                 */
        __IO uint32_t MSTSET;   /*!< DMAC setting                                 */
        __IO uint32_t DMACRDREQ;        /*!< DMAC Read request                            */
        __I uint32_t DMACRDVL;  /*!< DMAC Read Value                              */
        __IO uint32_t UDC2RDREQ;        /*!< UDC2 Read Request                            */
        __I uint32_t UDC2RDVL;  /*!< UDC2 Read Value                              */
        uint32_t RESERVED0[6];
        __IO uint32_t ARBTSET;  /*!< Arbiter Setting                              */
        __IO uint32_t MWSADR;   /*!< Master Write Start Address                   */
        __IO uint32_t MWEADR;   /*!< Master Write End Address                     */
        __I uint32_t MWCADR;    /*!< Master Write Current Address                 */
        __I uint32_t MWAHBADR;  /*!< Master Write AHB Address                     */
        __IO uint32_t MRSADR;   /*!< Master Read Start Address                    */
        __IO uint32_t MREADR;   /*!< Master Read End Address                      */
        __I uint32_t MRCADR;    /*!< Master Read Current Address                  */
        __I uint32_t MRAHBADR;  /*!< Master Read AHB Address                      */
        uint32_t RESERVED1[8];
        __IO uint32_t PWCTL;    /*!< Power Detect Control                         */
        __I uint32_t MSTSTS;    /*!< Master Status                                */
        __I uint32_t TOUTCNT;   /*!< Timeout Count                                */
    } TSB_UDFS_TypeDef;

/**
  * @brief UDC2(USB -Spec2.0 Device contoller)
  */
    typedef struct {
        __IO uint32_t ADR;      /*!< UDC2 Address State                           */
        __IO uint32_t FRM;      /*!< UDC2 Frame                                   */
        uint32_t RESERVED0;
        __IO uint32_t CMD;      /*!< UDC2 Command                                 */
        __I uint32_t BRQ;       /*!< UDC2 bRequest-bmRequest Type                 */
        __I uint32_t WVL;       /*!< UDC2 wValue                                  */
        __I uint32_t WIDX;      /*!< UDC2 wIndex                                  */
        __I uint32_t WLGTH;     /*!< UDC2 wLength                                 */
        __IO uint32_t INT;      /*!< UDC2 INT                                     */
        __IO uint32_t INTEP;    /*!< UDC2 INT_EP                                  */
        __IO uint32_t INTEPMSK; /*!< UDC2 INT_EP_MASK                             */
        __IO uint32_t INTRX0;   /*!< UDC2 INT RX DATA0                            */
        __IO uint32_t EP0MSZ;   /*!< UDC2 EP0 Max Packet Size                     */
        __I uint32_t EP0STS;    /*!< UDC2 EP0 Status                              */
        __I uint32_t EP0DSZ;    /*!< UDC2 EP0 Data Size                           */
        __IO uint32_t EP0FIFO;  /*!< UDC2 EP0 FIFO                                */
        __IO uint32_t EP1MSZ;   /*!< UDC2 EP1 Max Packet Size                     */
        __IO uint32_t EP1STS;   /*!< UDC2 EP1 Status                              */
        __I uint32_t EP1DSZ;    /*!< UDC2 EP1 Data Size                           */
        __IO uint32_t EP1FIFO;  /*!< UDC2 EP1 FIFO                                */
        __IO uint32_t EP2MSZ;   /*!< UDC2 EP2 Max Packet Size                     */
        __IO uint32_t EP2STS;   /*!< UDC2 EP2 Status                              */
        __I uint32_t EP2DSZ;    /*!< UDC2 EP2 Data Size                           */
        __IO uint32_t EP2FIFO;  /*!< UDC2 EP2 FIFO                                */
        __IO uint32_t EP3MSZ;   /*!< UDC2 EP3 Max Packet Size                     */
        __IO uint32_t EP3STS;   /*!< UDC2 EP3 Status                              */
        __I uint32_t EP3DSZ;    /*!< UDC2 EP3 Data Size                           */
        __IO uint32_t EP3FIFO;  /*!< UDC2 EP3 FIFO                                */
        __IO uint32_t EP4MSZ;   /*!< UDC2 EP4 Max Packet Size                     */
        __IO uint32_t EP4STS;   /*!< UDC2 EP4 Status                              */
        __I uint32_t EP4DSZ;    /*!< UDC2 EP4 Data Size                           */
        __IO uint32_t EP4FIFO;  /*!< UDC2 EP4 FIFO                                */
        __IO uint32_t EP5MSZ;   /*!< UDC2 EP5 Max Packet Size                     */
        __IO uint32_t EP5STS;   /*!< UDC2 EP5 Status                              */
        __I uint32_t EP5DSZ;    /*!< UDC2 EP5 Data Size                           */
        __IO uint32_t EP5FIFO;  /*!< UDC2 EP5 FIFO                                */
        __IO uint32_t EP6MSZ;   /*!< UDC2 EP6 Max Packet Size                     */
        __IO uint32_t EP6STS;   /*!< UDC2 EP6 Status                              */
        __I uint32_t EP6DSZ;    /*!< UDC2 EP6 Data Size                           */
        __IO uint32_t EP6FIFO;  /*!< UDC2 EP6 FIFO                                */
        __IO uint32_t EP7MSZ;   /*!< UDC2 EP7 Max Packet Size                     */
        __IO uint32_t EP7STS;   /*!< UDC2 EP7 Status                              */
        __I uint32_t EP7DSZ;    /*!< UDC2 EP7 Data Size                           */
        __IO uint32_t EP7FIFO;  /*!< UDC2 EP7 FIFO                                */
        uint32_t RESERVED1[32];
        __IO uint32_t INTNAK;   /*!< UDC2 INT NAK                                 */
        __IO uint32_t INTNAKMSK;        /*!< UDC2 INT NAK MASK                            */
    } TSB_UDFS2_TypeDef;

/**
  * @brief Analog-to-Digital Converter (AD)
  */
    typedef struct {
        __IO uint32_t CLK;      /*!< AD Conversion Clock Setting Register         */
        __O uint32_t MOD0;      /*!< AD Mode Control Register 0                   */
        __IO uint32_t MOD1;     /*!< AD Mode Control Register 1                   */
        __IO uint32_t MOD2;     /*!< AD Mode Control Register 2                   */
        __IO uint32_t MOD3;     /*!< AD Mode Control Register 3                   */
        __IO uint32_t MOD4;     /*!< AD Mode Control Register 4                   */
        __I uint32_t MOD5;      /*!< AD Mode Control Register 5                   */
        __O uint32_t MOD6;      /*!< AD Mode Control Register 6                   */
        __IO uint32_t MOD7;     /*!< AD Mode Control Register 7                   */
        __IO uint32_t CMPCR0;   /*!< AD Monitoring Setting Register 0             */
        __IO uint32_t CMPCR1;   /*!< AD Monitoring Setting Register 1             */
        __IO uint32_t CMP0;     /*!< AD Conversion Result Comparison Register 0   */
        __IO uint32_t CMP1;     /*!< AD Conversion Result Comparison Register 1   */
        __I uint32_t REG00;     /*!< AD Conversion Result Register 00             */
        __I uint32_t REG01;     /*!< AD Conversion Result Register 01             */
        __I uint32_t REG02;     /*!< AD Conversion Result Register 02             */
        __I uint32_t REG03;     /*!< AD Conversion Result Register 03             */
        __I uint32_t REG04;     /*!< AD Conversion Result Register 04             */
        __I uint32_t REG05;     /*!< AD Conversion Result Register 05             */
        __I uint32_t REG06;     /*!< AD Conversion Result Register 06             */
        __I uint32_t REG07;     /*!< AD Conversion Result Register 07             */
        __I uint32_t REG08;     /*!< AD Conversion Result Register 08             */
        __I uint32_t REG09;     /*!< AD Conversion Result Register 09             */
        __I uint32_t REG10;     /*!< AD Conversion Result Register 10             */
        __I uint32_t REG11;     /*!< AD Conversion Result Register 11             */
        uint32_t RESERVED0[4];
        __I uint32_t REGSP;     /*!< AD Conversion Result Register SP             */
    } TSB_AD_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PA)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PA Data Register                             */
        __IO uint32_t CR;       /*!< PA Control Register                          */
        uint32_t RESERVED0[8];
        __IO uint32_t OD;       /*!< PA Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PA Pull-Up Control Register                  */
        uint32_t RESERVED1[2];
        __IO uint32_t IE;       /*!< PA Input Enable Control Register             */
    } TSB_PA_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PB)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PB Data Register                             */
        __IO uint32_t CR;       /*!< PB Control Register                          */
        uint32_t RESERVED0[8];
        __IO uint32_t OD;       /*!< PB Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PB Pull-Up Control Register                  */
        uint32_t RESERVED1[2];
        __IO uint32_t IE;       /*!< PB Input Enable Control Register             */
    } TSB_PB_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PC)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PC Data Register                             */
        __IO uint32_t CR;       /*!< PC Control Register                          */
        __IO uint32_t FR1;      /*!< PC Function Register 1                       */
        uint32_t RESERVED0;
        __IO uint32_t FR3;      /*!< PC Function Register 3                       */
        __IO uint32_t FR4;      /*!< PC Function Register 4                       */
        uint32_t RESERVED1[4];
        __IO uint32_t OD;       /*!< PC Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PC Pull-Up Control Register                  */
        uint32_t RESERVED2[2];
        __IO uint32_t IE;       /*!< PC Input Enable Control Register             */
    } TSB_PC_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PD)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PD Data Register                             */
        __IO uint32_t CR;       /*!< PD Control Register                          */
        uint32_t RESERVED0[2];
        __IO uint32_t FR3;      /*!< PD Function Register 3                       */
        uint32_t RESERVED1[5];
        __IO uint32_t OD;       /*!< PD Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PD Pull-Up Control Register                  */
        uint32_t RESERVED2[2];
        __IO uint32_t IE;       /*!< PD Input Enable Control Register             */
    } TSB_PD_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PE)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PE Data Register                             */
        __IO uint32_t CR;       /*!< PE Control Register                          */
        __IO uint32_t FR1;      /*!< PE Function Register 1                       */
        uint32_t RESERVED0;
        __IO uint32_t FR3;      /*!< PE Function Register 3                       */
        __IO uint32_t FR4;      /*!< PE Function Register 4                       */
        uint32_t RESERVED1[4];
        __IO uint32_t OD;       /*!< PE Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PE Pull-Up Control Register                  */
        uint32_t RESERVED2[2];
        __IO uint32_t IE;       /*!< PE Input Enable Control Register             */
    } TSB_PE_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PF)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PF Data Register                             */
        __IO uint32_t CR;       /*!< PF Control Register                          */
        uint32_t RESERVED0;
        __IO uint32_t FR2;      /*!< PF Function Register 2                       */
        __IO uint32_t FR3;      /*!< PF Function Register 3                       */
        uint32_t RESERVED1[5];
        __IO uint32_t OD;       /*!< PF Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PF Pull-Up Control Register                  */
        uint32_t RESERVED2[2];
        __IO uint32_t IE;       /*!< PF Input Enable Control Register             */
    } TSB_PF_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PG)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PG Data Register                             */
        __IO uint32_t CR;       /*!< PG Control Register                          */
        __IO uint32_t FR1;      /*!< PG Function Register 2                       */
        uint32_t RESERVED0;
        __IO uint32_t FR3;      /*!< PG Function Register 3                       */
        __IO uint32_t FR4;      /*!< PG Function Register 4                       */
        uint32_t RESERVED1[4];
        __IO uint32_t OD;       /*!< PG Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PG Pull-Up Control Register                  */
        uint32_t RESERVED2[2];
        __IO uint32_t IE;       /*!< PG Input Enable Control Register             */
    } TSB_PG_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PH)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PH Data Register                             */
        __IO uint32_t CR;       /*!< PH Control Register                          */
        __IO uint32_t FR1;      /*!< PH Function Register 1                       */
        uint32_t RESERVED0;
        __IO uint32_t FR3;      /*!< PH Function Register 3                       */
        uint32_t RESERVED1[5];
        __IO uint32_t OD;       /*!< PH Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PH Pull-Up Control Register                  */
        uint32_t RESERVED2[2];
        __IO uint32_t IE;       /*!< PH Input Enable Control Register             */
    } TSB_PH_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PI)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PI Data Register                             */
        __IO uint32_t CR;       /*!< PI Control Register                          */
//        uint32_t RESERVED0[8];
        __IO uint32_t FR1;      /*!< PI Function Register 1                       */
        uint32_t RESERVED0[7];
        __IO uint32_t OD;       /*!< PI Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PI Pull-Up Control Register                  */
        __IO uint32_t PDN;      /*!< PI Pull-Down Control Register                */
        uint32_t RESERVED1;
        __IO uint32_t IE;       /*!< PI Input Enable Control Register             */
    } TSB_PI_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PJ)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PJ Data Register                             */
        __IO uint32_t CR;       /*!< PJ Control Register                          */
        uint32_t RESERVED0;
        __IO uint32_t FR2;      /*!< PJ Function Register 2                       */
        __IO uint32_t FR3;      /*!< PJ Function Register 3                       */
        uint32_t RESERVED1[6];
        __IO uint32_t PUP;      /*!< PJ Pull-Up Control Register                  */
        uint32_t RESERVED2[2];
        __IO uint32_t IE;       /*!< PJ Input Enable Control Register             */
    } TSB_PJ_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PK)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PK Data Register                             */
        __IO uint32_t CR;       /*!< PK Control Register                          */
        uint32_t RESERVED0;
        __IO uint32_t FR2;      /*!< PK Function Register 2                       */
        __IO uint32_t FR3;      /*!< PK Function Register 3                       */
        uint32_t RESERVED1[6];
        __IO uint32_t PUP;      /*!< PK Pull-Up Control Register                  */
        uint32_t RESERVED2[2];
        __IO uint32_t IE;       /*!< PK Input Enable Control Register             */
    } TSB_PK_TypeDef;

/**
  * @brief 16-bit Timer/Event Counter (TB)
  */
    typedef struct {
        __IO uint32_t EN;       /*!< TB Enable Register                           */
        __IO uint32_t RUN;      /*!< TB RUN Register                              */
        __IO uint32_t CR;       /*!< TB Control Register                          */
        __IO uint32_t MOD;      /*!< TB Mode Register                             */
        __IO uint32_t FFCR;     /*!< TB Flip-Flop Control Register                */
        __I uint32_t ST;        /*!< TB Status Register                           */
        __IO uint32_t IM;       /*!< TB Interrupt Mask Register                   */
        __I uint32_t UC;        /*!< TB Read Capture Register                     */
        __IO uint32_t RG0;      /*!< TB RG0 Timer Register                        */
        __IO uint32_t RG1;      /*!< TB RG1 Timer Register                        */
        __I uint32_t CP0;       /*!< TB CP0 Capture Register                      */
        __I uint32_t CP1;       /*!< TB CP1 Capture Register                      */
        __IO uint32_t DMA;      /*!< TB DMA Enable Register                       */
    } TSB_TB_TypeDef;

#if defined ( __CC_ARM   )      /* RealView Compiler */
#pragma anon_unions
#elif (defined (__ICCARM__))    /*  ICC Compiler     */
#pragma language=extended
#endif

/**
  * @brief Serial Bus Interface (SBI)
  */
    typedef struct {
        __IO uint32_t CR0;      /*!< SBI Control Register 0                       */
        __IO uint32_t CR1;      /*!< SBI Control Register 1 (I2C Mode)            */
        __IO uint32_t DBR;      /*!< SBI Data Buffer Register                     */
        __IO uint32_t I2CAR;    /*!< SBI I2C Bus Address Register                 */
        union {
            __O uint32_t CR2;   /*!< SBI Control Register 2 (I2C Mode)            */
            __I uint32_t SR;    /*!< SBI Status Register (I2C Mode)               */
        };
        __IO uint32_t BR0;      /*!< SBI Baud Rate Register 0                     */
    } TSB_SBI_TypeDef;

/**
  * @brief Serial Channel (SC)
  */
    typedef struct {
        __IO uint32_t EN;       /*!< SC Enable Register                           */
        __IO uint32_t BUF;      /*!< SC Buffer Register                           */
        __IO uint32_t CR;       /*!< SC Control Register                          */
        __IO uint32_t MOD0;     /*!< SC Mode Control Register 0                   */
        __IO uint32_t BRCR;     /*!< SC Baud Rate Generator Control Register      */
        __IO uint32_t BRADD;    /*!< SC Baud Rate Generator Control Register 2    */
        __IO uint32_t MOD1;     /*!< SC Mode Control Register 1                   */
        __IO uint32_t MOD2;     /*!< SC Mode Control Register 2                   */
        __IO uint32_t RFC;      /*!< SC RX FIFO Configuration Register            */
        __IO uint32_t TFC;      /*!< SC TX FIFO Configuration Register            */
        __I uint32_t RST;       /*!< SC RX FIFO Status Register                   */
        __I uint32_t TST;       /*!< SC TX FIFO Status Register                   */
        __IO uint32_t FCNF;     /*!< SC FIFO Configuration Register               */
        __IO uint32_t DMA;      /*!< SC DMA Enable Register                       */
    } TSB_SC_TypeDef;

/**
  * @brief Watchdog Timer (WD)
  */
    typedef struct {
        __IO uint32_t MOD;      /*!< WD Mode Register                             */
        __O uint32_t CR;        /*!< WD Control Register                          */
    } TSB_WD_TypeDef;

